<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Reeve — Politique de confidentialité</title>
  <style>
    * { margin: 0; padding: 0; box-sizing: border-box; }
    body { font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', sans-serif; background: #0A0B12; color: #E2E8F0; line-height: 1.7; padding: 2rem 1rem; }
    .container { max-width: 720px; margin: 0 auto; }
    h1 { font-size: 2rem; margin-bottom: 0.5rem; color: #fff; }
    h2 { font-size: 1.4rem; margin-top: 2rem; margin-bottom: 0.75rem; color: #A78BFA; }
    h3 { font-size: 1.1rem; margin-top: 1.5rem; margin-bottom: 0.5rem; color: #C4B5FD; }
    p, li { margin-bottom: 0.75rem; color: #CBD5E1; }
    ul { padding-left: 1.5rem; }
    a { color: #A78BFA; }
    .back { display: inline-block; margin-bottom: 1.5rem; color: #A78BFA; text-decoration: none; font-weight: 600; }
    .back:hover { text-decoration: underline; }
    .updated { color: #64748B; font-size: 0.85rem; margin-top: 3rem; }
  </style>
</head>
<body>
  <div class="container">
    <a href="index.html" class="back">&larr; Retour</a>
    <h1>Politique de confidentialit&eacute;</h1>
    <p class="updated">Derni&egrave;re mise &agrave; jour : 11 f&eacute;vrier 2026</p>

    <h2>1. Introduction</h2>
    <p>Reeve (&laquo; nous &raquo;, &laquo; notre &raquo;, &laquo; l'application &raquo;) est un journal de r&ecirc;ves intelligent. Cette politique de confidentialit&eacute; d&eacute;crit comment nous collectons, utilisons et prot&eacute;geons vos donn&eacute;es personnelles.</p>

    <h2>2. Donn&eacute;es collect&eacute;es</h2>
    <h3>2.1 Donn&eacute;es de compte</h3>
    <ul>
      <li><strong>Adresse email</strong> : utilis&eacute;e pour la cr&eacute;ation de compte et la connexion. Optionnelle &mdash; vous pouvez utiliser l'app en mode anonyme.</li>
      <li><strong>Pr&eacute;nom / pseudonyme</strong> : utilis&eacute; pour personnaliser votre exp&eacute;rience.</li>
    </ul>

    <h3>2.2 Donn&eacute;es de r&ecirc;ves</h3>
    <ul>
      <li><strong>Enregistrements audio</strong> : vos r&eacute;cits vocaux de r&ecirc;ves, stock&eacute;s de mani&egrave;re s&eacute;curis&eacute;e et accessibles uniquement par vous.</li>
      <li><strong>Transcriptions</strong> : texte g&eacute;n&eacute;r&eacute; &agrave; partir de vos enregistrements audio via le mod&egrave;le Whisper (embarqu&eacute; sur votre appareil ou via un service tiers).</li>
      <li><strong>Analyses et interpr&eacute;tations</strong> : g&eacute;n&eacute;r&eacute;es par intelligence artificielle &agrave; partir de vos transcriptions.</li>
      <li><strong>M&eacute;tadonn&eacute;es</strong> : date d'enregistrement, &eacute;motion ressentie, cat&eacute;gories th&eacute;matiques, personnes mentionn&eacute;es.</li>
    </ul>

    <h3>2.3 Donn&eacute;es d'abonnement</h3>
    <ul>
      <li><strong>Statut d'abonnement</strong> : nous conservons l'information de votre statut premium (actif ou non) et la date d'expiration. Les donn&eacute;es de paiement (carte bancaire, etc.) sont g&eacute;r&eacute;es exclusivement par Apple via l'App Store et ne transitent jamais par nos serveurs.</li>
      <li><strong>RevenueCat</strong> : nous utilisons RevenueCat pour g&eacute;rer les abonnements. RevenueCat re&ccedil;oit un identifiant anonyme associ&eacute; &agrave; votre compte mais n'a pas acc&egrave;s au contenu de vos r&ecirc;ves.</li>
    </ul>

    <h3>2.4 Donn&eacute;es techniques</h3>
    <ul>
      <li>Identifiant d'appareil anonymis&eacute; pour le fonctionnement de l'authentification.</li>
    </ul>

    <h2>3. Utilisation de l'intelligence artificielle</h2>
    <p><strong>Reeve utilise l'intelligence artificielle pour analyser vos r&ecirc;ves.</strong> Concr&egrave;tement :</p>
    <ul>
      <li>Vos r&eacute;cits de r&ecirc;ves (texte) sont envoy&eacute;s &agrave; un prestataire sp&eacute;cialis&eacute; en intelligence artificielle pour g&eacute;n&eacute;rer des interpr&eacute;tations, identifier les &eacute;motions et th&egrave;mes, et produire des bilans.</li>
      <li>Ce prestataire ne conserve pas les donn&eacute;es envoy&eacute;es via son API pour entra&icirc;ner ses mod&egrave;les.</li>
      <li>Vous &ecirc;tes inform&eacute;(e) de l'utilisation de l'IA et devez donner votre consentement avant la premi&egrave;re analyse.</li>
      <li>Les analyses g&eacute;n&eacute;r&eacute;es sont fournies &agrave; titre informatif et ne constituent pas un avis m&eacute;dical ou psychologique.</li>
    </ul>

    <h2>4. Utilisation des donn&eacute;es</h2>
    <p>Vos donn&eacute;es sont utilis&eacute;es exclusivement pour :</p>
    <ul>
      <li>Fournir le service de journal de r&ecirc;ves (stockage, affichage, recherche)</li>
      <li>G&eacute;n&eacute;rer des analyses et interpr&eacute;tations personnalis&eacute;es via l'IA</li>
      <li>Produire des bilans &eacute;motionnels et th&eacute;matiques agr&eacute;g&eacute;s de vos r&ecirc;ves</li>
      <li>G&eacute;rer votre abonnement et votre acc&egrave;s aux fonctionnalit&eacute;s premium</li>
    </ul>
    <p><strong>Nous ne vendons jamais vos donn&eacute;es.</strong> Nous ne les utilisons pas &agrave; des fins publicitaires.</p>

    <h2>5. Services tiers</h2>
    <ul>
      <li><strong>Supabase</strong> (h&eacute;bergement et base de donn&eacute;es) : vos donn&eacute;es sont stock&eacute;es sur des serveurs s&eacute;curis&eacute;s en Europe (Francfort). <a href="https://supabase.com/privacy">Politique Supabase</a></li>
      <li><strong>Prestataire IA</strong> (analyse des r&ecirc;ves) : vos transcriptions sont envoy&eacute;es &agrave; un prestataire sp&eacute;cialis&eacute; pour g&eacute;n&eacute;rer les analyses. Ce prestataire n'utilise pas vos donn&eacute;es pour entra&icirc;ner ses mod&egrave;les.</li>
      <li><strong>RevenueCat</strong> (gestion des abonnements) : re&ccedil;oit un identifiant anonyme pour g&eacute;rer votre abonnement. <a href="https://www.revenuecat.com/privacy">Politique RevenueCat</a></li>
      <li><strong>Apple App Store</strong> (paiements) : g&egrave;re les transactions financi&egrave;res. <a href="https://www.apple.com/legal/privacy/">Politique Apple</a></li>
    </ul>

    <h2>6. Stockage et s&eacute;curit&eacute;</h2>
    <ul>
      <li>Les donn&eacute;es sont stock&eacute;es sur Supabase (infrastructure AWS, r&eacute;gion Europe) avec chiffrement au repos et en transit.</li>
      <li>L'authentification est g&eacute;r&eacute;e via Supabase Auth avec des tokens JWT s&eacute;curis&eacute;s.</li>
      <li>Les enregistrements audio sont stock&eacute;s dans un bucket priv&eacute; accessible uniquement par leur propri&eacute;taire.</li>
      <li>Les donn&eacute;es sensibles (tokens) sont stock&eacute;es dans le trousseau s&eacute;curis&eacute; de votre appareil.</li>
    </ul>

    <h2>7. Vos droits</h2>
    <p>Conform&eacute;ment au RGPD, vous disposez des droits suivants :</p>
    <ul>
      <li><strong>Acc&egrave;s</strong> : toutes vos donn&eacute;es sont visibles dans l'application.</li>
      <li><strong>Rectification</strong> : vous pouvez modifier vos r&ecirc;ves &agrave; tout moment.</li>
      <li><strong>Suppression</strong> : vous pouvez supprimer chaque r&ecirc;ve individuellement ou demander la suppression compl&egrave;te de votre compte et de toutes vos donn&eacute;es depuis les param&egrave;tres de l'app.</li>
      <li><strong>Portabilit&eacute;</strong> : vous pouvez exporter l'ensemble de vos donn&eacute;es depuis les param&egrave;tres de l'app.</li>
    </ul>

    <h2>8. Conservation des donn&eacute;es</h2>
    <p>Vos donn&eacute;es sont conserv&eacute;es tant que votre compte existe. En cas de suppression de compte, toutes les donn&eacute;es associ&eacute;es (r&ecirc;ves, audio, analyses, historique d'utilisation) sont supprim&eacute;es d&eacute;finitivement sous 30 jours.</p>

    <h2>9. Mineurs</h2>
    <p>L'application n'est pas destin&eacute;e aux enfants de moins de 13 ans. Nous ne collectons pas sciemment de donn&eacute;es de mineurs de moins de 13 ans.</p>

    <h2>10. Modifications</h2>
    <p>Nous nous r&eacute;servons le droit de modifier cette politique. Toute modification sera publi&eacute;e sur cette page avec une date de mise &agrave; jour.</p>

    <h2>11. Contact</h2>
    <p>Pour toute question relative &agrave; vos donn&eacute;es personnelles :</p>
    <p>Email : <a href="mailto:contact@reeveapp.com">contact@reeveapp.com</a></p>

    <p class="updated">&copy; 2026 Reeve App</p>
  </div>
</body>
</html>
